Autodesk.Revit.DB.ElementOwnerViewFilter.ViewId
The view id.

Autodesk.Revit.DB.ElementOwnerViewFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a filter to match elements which are owned by a particular view,
with the option to invert the filter and find elements not owned by the given view.
viewId:
The view id to match.
Pass invalid element id to create a filter that will pass non-view-specific elements.
inverted:
True if the filter should match all elements which are not owned by the given view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ElementOwnerViewFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match elements which are owned by a particular view.
viewId:
The view id to match.
Pass invalid element id to create a filter that will pass non-view-specific elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ElementOwnerViewFilter
A filter used to match elements which are owned by a particular view.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.